app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
<<<<<<< HEAD
    @users = User.all

INSERT INTO "users" ("name", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)  [["name", "admin"], ["created_at", "2017-06-21 23:39:04.497080"], ["updated_at", "2017-06-21 23:39:04.497080"], ["password_digest", "$2a$10$pLTI/vc6qKNELNFwNQ0uBuBgCWIBd.33nI5nhRQ30Fi9Vc5jY4KB."]]
---
  def create
  	@user = User.new(user_params)
  	if @user.save